Repository: Prekzursil/webcoder
Catalog: site/locale/*/LC_MESSAGES/django.po
Languages: ro

source: Do not set this unless you know what you're doing! It will override the usually more specific, judge-provided runtime info!
ro: Nu bifați asta mai puțin dacă știți ce faceți! Va deturna informațile produse de grader!

source: language description
ro: descrierea limbajului

source: Use this field to inform users of quirks with your environment, additional restrictions, etc.
ro: Folosiți acest câmp ca să informați utilizatorii de mediul de programare, restricții adiționale, etc.

source: extension
ro: extensii

source: The extension of source files, e.g., "py" or "cpp".
ro: Extensia fișierelor sursă, "py" or "cpp".

source: languages
ro: limbaje

source: language to which this runtime belongs
ro: limba careia ii aparține informația aceasta de runtime

source: judge on which this runtime exists
ro: grader pe care există acest runtime

source: runtime name
ro: numele runtime

source: runtime version
ro: versiunea runtime

source: order in which to display this runtime
ro: ordinea în care se afisează acest runtime

source: Server name, hostname-style
ro: Numele server-ului, in stil de hostname

source: time of creation
ro: data creerii

source: A key to authenticate this judge
ro: Cheia pentru a autoriza acest grader

source: authentication key
ro: cheia de autentificare

source: block judge
ro: blochează grader

source: Whether this judge should be blocked from connecting, even if its key is correct.
ro: Dacă acest grader va fi blocat chiar dacă cheia este corectă.

source: judge online status
ro: statusul graderului

source: judge start time
ro: timpul de începere a graderului

source: response time
ro: timpul de răspundere

source: system load
ro: încărcarea sistem

source: Load for the last minute, divided by processors to be fair.
ro: Încărcarea in ultimul minut, împărţită la numarul de procesoare.

source: judges
ro: evaluatoare

source: judge
ro: evaluator

source: submission time
ro: timpul soluției

source: execution time
ro: timpul execuției

source: memory usage
ro: memoria folosită

source: points granted
ro: puncte acordate

source: submission language
ro: limba soluției

source: result
ro: rezultat

source: compile errors
ro: erori de compilare

source: batched cases
ro: cazuri grupate

source: test case points
ro: puncte pe test

source: test case total points
ro: totalul punctajului pe test

source: judged on
ro: grader pornit

source: was rejudged by admin
ro: a fost rejudecat de administrator

source: was ran on pretests only
ro: a fost rulat doar pe preteste

source: submissions
ro: submisii

source: associated submission
ro: soluție asociată

source: source code
ro: codul sursă

source: test case ID
ro: ID-ul cazului

source: status flag
ro: starea steagului

source: points possible
ro: puncte posibile

source: batch number
ro: numărul grupului

source: judging feedback
ro: feedback-ul graderului

source: extended judging feedback
ro: feedback-ul extins al graderului

source: program output
ro: afișarea programului

source: submission test case
ro: testul submisiei

source: submission test cases
ro: testele submisiei

source: ticket title
ro: titlul raportului

source: ticket creator
ro: creatorul raportului

source: creation time
ro: data creerii

source: assignees
ro: numiții

source: quick notes
ro: notă rapidă

source: Staff notes for this issue to aid in processing.
ro: Notițe pentru administratori pentru această problemă ca să ajute în acest proces.

source: linked item type
ro: tipul itemului asociat

source: linked item ID
ro: ID-ul itemului asociat

source: is ticket open?
ro: este raportul deschis?

source: ticket
ro: raport

source: message time
ro: timpul mesajului

source: Page [page] of [topage]
ro: Pagina [page] din [topage]

source: Running MOSS
ro: Rulând MOSS

source: Modifying submissions
ro: Modificând soluția

source: Recalculating user points
ro: Recalculând punctele utilizatorului

source: Empty batches not allowed.
ro: Grupurile goale nu sunt permise.

source: Points must be defined for non-batch case #%d.
ro: Punctele trebuie definite pentru cazurile negrupate #%d.

source: Input file for case %d does not exist: %s
ro: Fișierul de intrare pentru cazul %d nu există: %s

source: Output file for case %d does not exist: %s
ro: Fișierul de ieșire pentru cazul %d nu există: %s

source: Batch start case #%d requires points.
ro: Începutul grupului #%d necesită puncte.

source: Attempt to end batch outside of one in case #%d
ro: Se încearcă terminarea grupului în afara unuia în cazul #%d

source: How did you corrupt the zip path?
ro: Cum ai corupt calea zip?

source: How did you corrupt the generator path?
ro: Cum ai corupt calea generatorului?

source: Wrong
ro: Greșit

source: Timeout
ro: Limită de timp depășită

source: Error
ro: Eroare

source: Can't pass both queryset and keyword filters
ro: Nu se poate trece amândoua queryset şi filtrele cu cuvinte cheie

source: Your password can't be a commonly used password.
ro: Parola nu pate fi una comună.

source: This password is too common.
ro: Parola este prea comună.

# time format with day
source: %d day %h:%m:%s
ro: %d zi %h:%m:%s

# time format no seconds with day
source: %d day %h:%m
ro: %d zi %h:%m

source: %d day
ro: %d zi

source: Page %d of Posts
ro: Pagina %d din Posturi

source: Messing around, are we?
ro: Ne facem de cap, nu-i așa?

source: You must solve at least one problem before you can vote.
ro: Trebuie să rezolvi cel puțin o problemă ca să poți vota.

source: You already voted.
ro: Ai votat deja.

source: Edited from site
ro: Editat de pe site

source: Editing comment
ro: Editează comentariul

source: No such contest
ro: Niciun concurs de acest fel

source: Could not find a contest with the key "%s".
ro: Niciun concurs găsit cu cheia "%s".

source: Contests
ro: Concursuri

source: Past Contests
ro: Concursuri terminate

source: Could not find such contest.
ro: Nu am putut găsi un concurs de acest fel.

source: Access to contest "%s" denied
ro: Nu aveți acces la concursul "%s"

source: Clone Contest
ro: Clonează Concursul

source: Contest not ongoing
ro: Concursul nu este în curs de desfăşurare

source: "%s" is not currently ongoing.
ro: Momentan, "%s" nu este în curs de desfăşurare.

source: Already in contest
ro: Deja în concurs

source: You are already in a contest: "%s".
ro: Sunteţi deja într-un concurs: "%s".

source: Banned from joining
ro: Îți este interzis să te alături

source: You have been declared persona non grata for this contest. You are permanently barred from joining this contest.
ro: Nu vei putea niciodată să te alături acestui concurs!

source: Enter access code for "%s"
ro: Introdu codul de acces pentru "%s"

source: You are not in contest "%s".
ro: Nu sunteţi în concursul "%s".

source: Contests in %(month)s
ro: Concursuri în %(month)s

source: %s Statistics
ro: %s Statistici

source: %s Rankings
ro: %s Clasament

source: Your participation in %s
ro: Participarea ta în %s

source: %s's participation in %s
ro: Participarea lui %s's în %s

source: Participation
ro: Participare

source: %s MOSS Results
ro: %s Rezultate MOSS

source: Running MOSS for %s...
ro: Rulând MOSS pentru %s...

source: Contest tag: %s
ro: Eticheta concursului: %s

source: 404 error
ro: eroare 404

source: Could not find page "%s"
ro: Nu am putut găsi pagina "%s"

source: no permission for %s
ro: nicio permisiune pentru %s

source: corrupt page %s
ro: pagina corupta %s

source: Runtimes
ro: Limbaje

source: No such organization
ro: Nicio organizaţie de acest fel

source: Could not find an organization with the key "%s".
ro: Nicio organizaţie găsită cu cheia "%s".

source: Could not find such organization.
ro: Nu am putut găsi organizaţii de acest fel.

source: Organizations
ro: Organizaţii

source: %s Members
ro: %s Membri

source: Joining organization
ro: Aderarea la organizaţie

source: You are already in the organization.
ro: Sunteţi deja în organizaţie.

source: This organization is not open.
ro: Această organizaţie nu este deschisă.

source: Leaving organization
ro: Părăsire organizaţie

source: You are not in "%s".
ro: Nu sunteţi în "%s".

source: Request to join %s
ro: Cerere de adăugare la %s

source: Join request detail
ro: Detalii despre cererea de adăugare

source: Managing join requests for %s
ro: Gestionarea cererilor de asociere cu %s

source: Your organization can only receive %d more members. You cannot approve %d users.
ro: Organizația ta poate primii doar %d membrii. Nu poți aproba %d utilizatori.

source: Approved %d user.
ro: Aprobat %d utilizator.

source: Rejected %d user.
ro: Respins %d utilizator.

source: Editing %s
ro: Editare %s

source: Can't edit organization
ro: Nu puteţi edita organizaţia

source: You are not allowed to edit this organization.
ro: Nu aveţi permisiunea pentru a edita această organizaţie.

source: You are not allowed to kick people from this organization.
ro: Nu ai voie să dai afară utilizatori din această organizație.

source: Can't kick user
ro: Nu poți da afară utilizatorul

source: The user you are trying to kick does not exist!
ro: Utilizatorul pe care încerci să il dai afară nu există!

source: The user you are trying to kick is not in organization: %s.
ro: Utilizatorul pe care încerci să îl dai afară nu se află în organizație: %s.

source: No such problem
ro: Nicio problemă de acest fel

source: Could not find a problem with the code "%s".
ro: Imposibil de găsit probleme cu codul "%s".

source: Editorial for {0}
ro: Redactarea pentru {0}

source: Editorial for <a href="{1}">{0}</a>
ro: Redactarea pentru <a href="{1}">{0}</a>

source: Problems
ro: Probleme

source: Banned from submitting
ro: Interzis din a trimite

source: You have been declared persona non grata for this problem. You are permanently barred from submitting this problem.
ro: Ați fost declarat "persoană neacceptată" pentru această problemă. Sunteți exclus definitiv de la submiterea acestei probleme.

source: Too many submissions
ro: Prea mult soluții

source: You have exceeded the submission limit for this problem.
ro: Ai depășit limita de soluții pentru această problemă.

source: Submit to %(problem)s
ro: Trimite la %(problem)s

source: Clone Problem
ro: Clonează Problema

source: Checker arguments must be a JSON object
ro: Argumentele verificatorului trebuie să fie obiecte JSON

source: Checker arguments is invalid JSON
ro: Argumentele verificatorului este un obiect invalid JSON

source: Your zip file is invalid!
ro: Fișierul zip este invalid!

source: Comparing submissions for {0}
ro: Compară soluțile pentru {0}

source: Comparing submissions for <a href="{1}">{0}</a>
ro: Comparând soluțile pentru <a href="{1}">{0}</a>

source: Editing data for {0}
ro: Editând datele pentru {0}

source: Editing data for %s
ro: Editând datele pentru %s

source: Generated init.yml for %s
ro: S-a generat init.yml pentru %s

source: Managing submissions for %s
ro: Administrând soluțile pentru %s

source: Rejudging selected submissions for %s...
ro: Rejudecând soluțile selectate pentru %s...

source: Rescoring all submissions for %s...
ro: Recalculând scorul pentru toate soluțile %s...

source: Successfully scheduled %d submission for rejudging.
ro: S-a programat rejudecarea soluției %d

source: Best solutions for %s
ro: Cele mai bune soluţii pentru %s

source: Best solutions for <a href="{1}">{0}</a>
ro: Cele mai bune soluţii pentru <a href="{1}">{0}</a>

source: Best solutions for %(problem)s in %(contest)s
ro: Cele mai bune soluţii pentru %(problem)s în %(contest)s

source: Best solutions for problem %(number)s in %(contest)s
ro: Cele mai bune soluții pentru problema %(number)s în %(contest)s

source: Best solutions for <a href="{1}">{0}</a> in <a href="{3}">{2}</a>
ro: Cele mai bune soluţii pentru <a href="{1}">{0}</a> în <a href="{3}">{2}</a>

source: Best solutions for problem {0} in <a href="{2}">{1}</a>
ro: Cele mai bune soluții pentru problema {0} în <a href="{2}">{1}</a>

source: A username must contain letters, numbers, or underscores
ro: Numele de utilizator trebuie să conţină litere, numere sau caractere de subliniere

source: Preferred language
ro: Limba preferată

source: Subscribe to newsletter?
ro: Abonează-te la noutăți?

source: The email address "%s" is already taken. Only one registration is allowed per address.
ro: Adresa de email "%s" a fost deja folosită. O singură înregistrare este permisă pe fiecare adresă.

source: Your email provider is not allowed due to history of abuse. Please use a reputable email provider.
ro: Furnizorul dvs. de e-mail nu este permis datorită istoriei de abuz. Vă rugăm să folosiţi un furnizor de e-mail respectabil.

source: Registration
ro: Înregistrare

source: Authentication failure
ro: Problemă la autentificare

source: Language statistics
ro: Statistici ale limbei

source: Status
ro: Stare

source: Version matrix
ro: Versiunea matricii

source: Submission of %(problem)s by %(user)s
ro: Soluţia problemei %(problem)s de %(user)s

source: All submissions
ro: Toate soluţile

source: All my submissions
ro: Toate soluțile

source: All submissions by %s
ro: Toate soluţiile submise de %s

source: All submissions for %s
ro: Toate soluţiile pentru %s

source: Must pass a problem
ro: Trebuie să rezolvaţi o problemă

source: My submissions for %(problem)s
ro: Soluțile mele pentru %(problem)s

source: %(user)s's submissions for %(problem)s
ro: Soluţiile lui %(user)s pentru %(problem)s

source: Must pass a contest
ro: Trebuie să completaţi un concurs

source: <a href="{1}">{0}</a>'s submissions for <a href="{3}">{2}</a> in <a href="{5}">{4}</a>
ro: Soluţiile lui <a href="{1}">{0}</a> pentru <a href="{3}">{2}</a> în <a href="{5}">{4}</a>

source: <a href="{1}">{0}</a>'s submissions for problem {2} in <a href="{4}">{3}</a>
ro: <a href="{1}">{0}</a>'s soluțile pentru problema {2} în <a href="{4}">{3}</a>

source: Ticket title
ro: Titlul raportului

source: Issue description
ro: Descrierea problemei

source: New ticket for %s
ro: Raport nou pentru %s

source: %(title)s - Ticket %(id)d
ro: %(title)s - Raport %(id)d

source: Tickets - Page %(number)d of %(total)d
ro: Rapoarte - Pagina %(number)d din %(total)d

source: New Ticket: %s
ro: Raport nou: %s

source: #%(id)d, assigned to: %(users)s
ro: #%(id)d, atribuit lui: %(users)s

source: no one
ro: nimeni

source: New Ticket Message For: %s
ro: Mesaj nou la raport pentru: %s

source: Enable Two Factor Authentication
ro: Activează 2FA

source: Disable Two Factor Authentication
ro: Dezactivează 2FA

source: Perform Two Factor Authentication
ro: Rulează 2FA

source: No such user
ro: Niciun astfel de utilizator

source: No user handle "%s".
ro: Porecla de utilizator "%s" nu există.

source: My account
ro: Contul meu

source: User %s
ro: Utilizatorul %s

source: Updated on site
ro: Actualizat pe loc

source: Edit profile
ro: Editează-ți profilul

source: Leaderboard
ro: Clasament

source: Invalid upstream data: %s
ro: Informațiile trimise sunt invalide: %s

source: Bad latitude or longitude
ro: Latitudine sau longitudine nepotrivită

source: Are you sure you want to rejudge ALL the submissions?
ro: Ești sigur că vrei să rejurizezi TOATE soluțiile?

source: Rate
ro: Dă notă

source: Rate all ratable contests
ro: Dă o notă la toate concursurile adecvate

source: Disconnect
ro: Deconectare

source: Terminate
ro: Terminare

source: View Submissions
ro: Vezi Soluții

source: View submissions
ro: Vezi soluții

source: Edit user
ro: Editează utilizator

source: Rejudge
ro: Rejurizeză

source: Admin
ro: Administrare

source: My submissions
ro: Soluţiile mele

source: Log in
ro: Autentificare

source: or
ro: sau

source: spectating
ro: observând

source: This site works best with JavaScript enabled.
ro: Acest site funcționează cel mai bine cu JavaScript activat.

source: Edit
ro: Modifică

source: posted on %(time)s
ro: postat la %(time)s

source: on %(time)s
ro: la %(time)s

source: Events
ro: Evenimente

source: News
ro: Noutăți

source: posted on {time}
ro: postat la {time}

source: Clarifications
ro: Clarificări

source: No clarifications have been made at this time.
ro: Nicio clarificare nu a fost făcută.

source: Ongoing contests
ro: Concursuri in desfășurare

source: Upcoming contests
ro: Concursuri programate

source: Comment stream
ro: Comentarii

source: New problems
ro: Probleme noi

source: My open tickets
ro: Rapoartele mele deschise

source: New tickets
ro: Rapoarte noi

source: Please login to vote
ro: Logați-vă să votați

source: commented on {time}
ro: comentariu făcut la {time}

source: edit %(edits)s
ro: editează %(edits)s

source: edited
ro: editat

source: Reply
ro: Răspunde

source: Hide
ro: Ascunde

source: This comment is hidden due to too much negative feedback. Click <a href="javascript:comment_show_content(%(id)s)">here</a> to view it.
ro: Acest comentariu este ascuns din cauza feedback-ului negativ Dă click <a href="javascript:comment_show_content(%(id)s)">here</a> să o vezi.

source: There are no comments at the moment.
ro: Nu sunt comentarii în acest moment.

source: New comment
ro: Comentariu nou

source: Post!
ro: Postează!

source: Comments are disabled on this page.
ro: Comentarile sunt dezactivate pe această pagină.

source: Invalid access code.
ro: Cod de acces invalid.

source: Please enter your access code:
ro: Introdu codul de acces:

source: Join Contest
ro: Alăturăte concursului

source: Sunday
ro: Duminică

source: Monday
ro: Luni

source: Tuesday
ro: Marți

source: Wednesday
ro: Miercuri

source: Thursday
ro: Joi

source: Friday
ro: Vineri

source: Saturday
ro: Sâmbătă

source: Enter a new key for the cloned contest:
ro: Introdu o nouă cheie pentru concursul clonat:

source: Clone!
ro: Clonează!

source: Prev
ro: Anterior

source: Today
ro: Azi

source: Next
ro: Următor

source: List
ro: Listă

source: Info
ro: Informații

source: Statistics
ro: Stastici

source: Rankings
ro: Clasament

source: Hidden Rankings
ro: Clasament ascuns

source: Clone
ro: Clonează

source: Leave contest
ro: Părăsiți concursul

source: Virtual join
ro: Intrare virtuală

source: Stop spectating
ro: Oprește observarea

source: Spectate contest
ro: Observă concursul

source: Join contest
ro: Intră în concurs

source: Log in to participate
ro: Loghează-te pentru a participa

source: Participating virtually.
ro: Participând virtual.

source: Contest is over.
ro: Concursul s-a terminat.

source: <b>%(time_limit)s</b> window between <b>%(start_time)s</b> and <b>%(end_time)s</b>
ro: <b>%(time_limit)s</b> fereastră între <b>%(start_time)s</b> și <b>%(end_time)s</b>

source: <b>%(length)s</b> long starting on <b>%(start_time)s</b>
ro: <b>%(length)s</b> lung începând la <b>%(start_time)s</b>

source: AC Rate
ro: Rată succes

source: Users
ro: Utilizatori

source: Are you sure you want to join?
ro: Ești sigur că vrei să te alături?

source: Joining a contest for the first time starts your timer, after which it becomes unstoppable.
ro: Intrând în concurs pentru prima dată pornește un cronometru, care devine de neoprit.

source: hidden
ro: ascuns

source: private
ro: privat

source: rated
ro: evaluat

source: Spectate
ro: Observă

source: Join
ro: Intră

source: Active Contests
ro: Concursuri Active

source: Ongoing Contests
ro: Concursuri in desfășurare

source: Upcoming Contests
ro: Concursuri programate

source: There are no scheduled contests at this time.
ro: Nu există concursuri programate în acest moment.

source: Are you sure you want to leave?
ro: Ești sigur că vrei să părăsești?

source: You cannot come back to a virtual participation. You will have to start a new one.
ro: Nu te poți întoarce la o participare virtuală. Trebuie să începi una nouă.

source: Joining a contest starts your timer, after which it becomes unstoppable.
ro: Intrând în concurs pentru prima dată pornește un cronometru, care devine de neoprit.

source: Are you sure you want MOSS the contest?
ro: Ești sigur că vrei MOSS acest concurs?

source: Are you sure you want to delete the MOSS results?
ro: Ești sigur că vrei să ștergi rezultatele MOSS?

source: No submissions
ro: Nicio soluție

source: Re-MOSS contest
ro: Re-Moss concursul

source: Delete MOSS results
ro: Șterge rezultatele MOSS

source: This contest is private to specific users.
ro: Acest concurs este privat pentru anumiți utilizatori.

source: Additionally, only the following organizations may access this contest:
ro: Pe lângă asta, numai următoarele organizații pot accesa concursul:

source: Only the following organizations may access this contest:
ro: Numai următoarele organizații pot accesa acest concurs:

source: Organization
ro: Organizație

source: Un-Disqualify
ro: De-Descalifcă

source: Disqualify
ro: Descalifică

source: Are you sure you want to disqualify this participation?
ro: Ești sigur că vrei să descalifici această participare?

source: Are you sure you want to un-disqualify this participation?
ro: Ești sigur că vrei să de-descalifici această participare?

source: View user participation
ro: Vezi participarea utilizatorului

source: Show organizations
ro: Arată organizațiile

source: Problem Status Distribution
ro: Statutul de distribuire al problemei

source: Problem AC Rate
ro: Rata de succes a problemei

source: Submissions by Language
ro: Soluții după limbă

source: Language AC Rate
ro: Procent soluții corecte (AC) după limbă

source: Source:
ro: Sursă:

source: Newsletter
ro: Buletin

source: activate
ro: activează

source: You have successfully been unsubscribed.
ro: Ați fost dezabonat cu succes.

source: Newsletter unsubscribe
ro: Dezabonare buletin

source: Your unsubscription request has successfully been received. An email has been sent to you with a link you need to follow in order to confirm your unsubscription.
ro: Solicitarea de dezabonare a fost primită cu succes. Un email a fost trimis către dumneavoastră cu un link pe care trebuie să îl accesați pentru a confirma dezabonarea.

source: Do you want to unsubscribe from this newsletter?
ro: Doriți să vă dezabonați de la acest buletin?

source: Unsubscribe
ro: Dezabonare

source: Newsletter update
ro: Actualizare buletin

source: Due to a technical error we were not able to submit your confirmation email. This could be because your email address is invalid.
ro: Din cauza unei erori tehnice, nu am fost capabili să trimitem email-ul de confirmare. Acest lucru ar putea fi din cauză că adresa de email introdusă nu este validă.

source: Update subscription
ro: Actualizează abonamentul

source: Your subscription has successfully been updated.
ro: Abonamentul dumneavoastră a fost actualizat cu succes.

source: Your update request was successfully received and an activation email has been sent to you. In that email you will find a link which you need to follow in order to update your subscription.
ro: Cererea dumneavoastră de actualizare a fost primită cu succes. Un email a fost trimis către dumneavoastră. Urmaţi link-ul de activare din acel email pentru a actualiza abonamentul.

source: Update
ro: Actualizare

source: Are you sure you want to leave this organization?
ro: Ești sigur că vrei să părăsești această organizație?

source: You will have to rejoin to show up on the organization leaderboard.
ro: Va trebuii să reintri ca să vezi clasamentul organizației.

source: You will have to request membership in order to join again.
ro: Va trebuii să faci cerere ca să poți să te alături din nou.

source: Leave organization
ro: Părăsiţi organizaţia

source: Join organization
ro: Alăturaţi-vă organizaţiei

source: Request membership
ro: Cerere de membru

source: Edit organization
ro: Editează organizaţia

source: View requests
ro: Vezi solicitări

source: Admin organization
ro: Administratorul organizației

source: View members
ro: Vezi membrii

source: Name
ro: Nume

source: Members
ro: Membrii

source: Create
ro: Crează

source: User:
ro: Nume de utilizator:

source: Organization:
ro: Organizaţie:

source: Time:
ro: Ora:

source: Reason:
ro: Motiv:

source: State
ro: Stare
