Repository: Prekzursil/webcoder
Catalog: site/locale/*/LC_MESSAGES/django.po
Languages: ro

source: English
ro: Engleză

source: Romanian
ro: Română

source: Home
ro: Start

source: %d comment successfully hidden.
ro: %d comentarii ascunse cu succes.

source: Hide comments
ro: Ascunde comentarii

source: %d comment successfully unhidden.
ro: %d comentariu ascuns cu succes.

source: Unhide comments
ro: Reafişează comentariile

source: Associated page
ro: Pagină associată

source: Included contests
ro: Concursuri incluse

source: Problem
ro: Problemă

source: Settings
ro: Setări

source: Scheduling
ro: Programare

source: Details
ro: Detalii

source: Rating
ro: Scor

source: Access
ro: Acces

source: Justice
ro: Justiţie

source: %d contest successfully marked as visible.
ro: %d concurs marcat ca visibil.

source: Mark contests as visible
ro: Marchează concurs ca vizibil

source: %d contest successfully marked as hidden.
ro: %d concurs marcat ca invisibil.

source: Mark contests as hidden
ro: Marchează concurs ca invizibil

source: %d submission was successfully scheduled for rejudging.
ro: %d soluție marcată pentru rejurizare.

source: %d participation recalculated.
ro: %d participare recalculată

source: Recalculate results
ro: Rezultatele recalculate

source: username
ro: nume de utilizator

source: link path
ro: calea linkului

source: Content
ro: Conţinut

source: Summary
ro: Rezumat

source: user
ro: utilizator

source: object
ro: obiect

source: View on site
ro: Vezi pe site

source: Describe the changes you made (optional)
ro: Descrie modificările făcute (opţional)

source: Taxonomy
ro: Taxonomie

source: Points
ro: Puncte

source: Limits
ro: Limite

source: Language
ro: Limbaj

source: History
ro: Istoric

source: Authors
ro: Autori

source: %d problem successfully marked as public.
ro: %d problemă marcată ca publică cu succes.

source: Mark problems as public
ro: Marchează probleme ca publice

source: %d problem successfully marked as private.
ro: %d problemă marcată ca privată cu succes.

source: Mark problems as private
ro: Marchează probleme ca private

source: timezone
ro: fus orar

source: User
ro: Utilizator

source: Timezone
ro: Fus orar

source: date joined
ro: data înscriere

source: %d user have scores recalculated.
ro: %d utilizator au scoruri recalculate.

source: Recalculate scores
ro: Recalculați scorurile

source: Disallowed problems
ro: Probleme nepermise

source: These problems are NOT allowed to be submitted in this language
ro: Aceste probleme NU pot fi transmise în acest limbaj

source: Description
ro: Descriere

source: Information
ro: Informație

source: Capabilities
ro: Capabilități

source: None
ro: Gol

source: Exceptional
ro: Excepțional

source: Unaccepted
ro: Neacceptate

# contest problem
source: %(problem)s in %(contest)s
ro: %(problem)s în %(contest)s

source: You do not have the permission to rejudge submissions.
ro: Nu aveţi permisiunea de a rejuriza submisii.

source: You do not have the permission to rejudge THAT many submissions.
ro: Nu aveţi permisiunea de a rejuriza ATÂT de multe submisii.

source: Rejudge the selected submissions
ro: Rejurizează submisiile selectate

source: %d submission were successfully rescored.
ro: %d submisie a fost repunctată cu succes.

source: Rescore the selected submissions
ro: Repunctează submisiile selectate

source: Problem code
ro: Codul problemei

source: Problem name
ro: Nume problemă

source: Time
ro: Ora

source: Memory
ro: Memorie

source: Included problems
ro: Probleme incluse

source: These problems are included in this group of problems
ro: Aceste probleme sunt incluse în acest grup de probleme

source: These problems are included in this type of problems
ro: Aceste probleme sunt incluse în acest tip de probleme

source: Comment body
ro: Comentariu

source: Your part is silent, little toad.
ro: Partea ta este tăcută, mărunt.

source: You need to have solved at least one problem before your voice can be heard.
ro: Trebuie sa fi rezolvat cel puțin o problemă pentru a vorbi.

source: Posted comment
ro: Comentariu postat

source: Default
ro: Mod implicit

source: Subscribe to contest updates
ro: Abonează-te la updaturile de la concurs

source: Enable experimental features
ro: Pornește funcțile experimentale

source: You may not be part of more than {count} public organizations.
ro: Nu poți fi parte din mai mult de {count} organizații publice.

source: Username
ro: Nume de utilizator

source: Password
ro: Parola

source: Two Factor Authentication tokens must be 6 decimal digits.
ro: Codul de Two Factor Authentication trebuie să aiba 6 cifre.

source: Invalid Two Factor Authentication token.
ro: Codul de Two Factor Authentication este invalid.

source: Problem code must be ^[a-z0-9]+$
ro: Codul problemei trebuie să fie ^[a-z0-9]+$

source: Problem with code already exists.
ro: Problema cu codul deja există.

source: Contest id must be ^[a-z0-9]+$
ro: Identificatorul de concurs trebuie să fie ^[a-z0-9]+$

source: Contest with key already exists.
ro: Concursul cu cheia există deja.

source: on {time}
ro: la {time}

source: Leave as LaTeX
ro: Lasă ca LaTeX

source: SVG with PNG fallback
ro: SVG cu PNG retragere.

source: MathML only
ro: doar MathML

source: MathJax with SVG/PNG fallback
ro: MathJax cu SVG/PNG retragere

source: Detect best quality
ro: Detectează cea mai bună calitate

source: Page code must be ^[pcs]:[a-z0-9]+$|^b:\d+$
ro: Codul pagini trebuie să fie ^[pcs]:[a-z0-9]+$|^b:\d+$

source: commenter
ro: comentator

source: posted time
ro: data postări

source: associated page
ro: pagină asociată

source: votes
ro: voturi

source: body of comment
ro: corpul comentariului

source: hide the comment
ro: ascunde comentariul

source: parent
ro: părinte

source: comment
ro: comentariu

source: comments
ro: comentarii

source: Editorial for %s
ro: Soluție pentru %s

source: comment vote
ro: votul comentariului

source: comment votes
ro: voturile comentariului

source: Override comment lock
ro: Trece pe lângă lacătul comentarilor

source: Invalid colour.
ro: Culoare invalida.

source: tag name
ro: nume de etichetă

source: Lowercase letters and hyphens only.
ro: Litere mici doar.

source: tag colour
ro: culoare de eticheta

source: tag description
ro: descrierea etichetei

source: contest tag
ro: eticheta concursului

source: contest tags
ro: etichetele concursului

source: contest id
ro: id-ul concursului

source: contest name
ro: numele concursului

source: These people will be able to edit the contest.
ro: Aceste persoane vor putea să editeze concursul.

source: description
ro: descriere

source: problems
ro: probleme

source: start time
ro: timpul de început

source: end time
ro: timpul de sfârșit

source: time limit
ro: limită de timp

source: publicly visible
ro: visibilitate publică

source: Should be set even for organization-private contests, where it determines whether the contest is visible to members of the specified organizations.
ro: Trebuie setat și pentru concursurile private ale organizaților, unde determină dacă concursul este visibil membrilor ale organizaților specificate.

source: contest rated
ro: concurs evaluat

source: Whether this contest can be rated.
ro: Dacă acest concurs poate fi evaluat.

source: hide scoreboard
ro: ascunde scorul

source: Whether the scoreboard should remain hidden for the duration of the contest.
ro: Dacă scorul v-a rămâne ascuns pe durata concursului.

source: no comments
ro: niciun comentariu

source: Use clarification system instead of comments.
ro: Folosește sistemul de clarificare înloc de comentarii.

source: Rating floor for contest
ro: Evaluare prin lipsă a concursului

source: Rating ceiling for contest
ro: Evaluarea prin adaos a concursului

source: rate all
ro: evaluează tot

source: Rate all users who joined.
ro: Evaluează toţi utilizatorii care s-au inscris.

source: exclude from ratings
ro: exclude din evaluări

source: private to specific users
ro: privat mai puțin pentru utilizatori specifici

source: private contestants
ro: participanți privați

source: If private, only these users may see the contest
ro: Dacă este privat, numai acești utilizatori pot vedea concursul

source: hide problem tags
ro: ascunde cuvintele cheie ale problemei

source: Whether problem tags should be hidden by default.
ro: Dacă cuvintele cheie ale problemei să rămână ascunse implicit.

source: run pretests only
ro: pornește pre-testele doar

source: Whether judges should grade pretests only, versus all testcases. Commonly set during a contest, then unset prior to rejudging user submissions when the contest ends.
ro: Dacă grader-ul ar trebuii să evalueze pre-testele doar, în loc de toate testele. De obicei se setează într-un concurs, după se scoate pentru a rejuriza soluțile când se încheie concursul.

source: private to organizations
ro: privat pentru organizații

source: organizations
ro: organizații

source: If private, only these organizations may see the contest
ro: Dacă e privat, doar aceste organizaţii pot vedea acest concurs

source: OpenGraph image
ro: Imagine OpenGraph

source: Logo override image
ro: Logo cu imagine

source: This image will replace the default site logo for users inside the contest.
ro: Această imagine va înlocui logo-ul implicit al site-ului pentru utilizatorii în acest concurs.

source: the amount of live participants
ro: numărul de participanți live

source: contest summary
ro: rezumatul concursului

source: Plain-text, shown in meta description tag, e.g. for social media.
ro: Test simplu, în descrierea pentru social media.

source: access code
ro: cod de acces

source: An optional code to prompt contestants before they are allowed to join the contest. Leave it blank to disable.
ro: Un cod opțional pentru a anunța participanții înainte să le fie permisă intrarea în concurs. Lasă gol pentru dezactivare.

source: Bans the selected users from joining this contest.
ro: Interzice utilizatorilor selectați din a intra în concurs.

source: contest format
ro: formatul concursului

source: The contest format module to use.
ro: Formatul modulului concursului folosit.

source: contest format configuration
ro: configurarea formatului concursului

source: A JSON object to serve as the configuration for the chosen contest format module. Leave empty to use None. Exact format depends on the contest format selected.
ro: Un obiect JSON care servește pentru a configura formatul modulului concursului. A se lăsa gol pentru niciunul. Formatul exact depinde de formatul concursului selectat.

source: See private contests
ro: Vezi concursuri private

source: Edit own contests
ro: Editează proprile concursuri

source: Edit all contests
ro: Editează toate concursurile

source: Clone contest
ro: Clonează concursul

source: MOSS contest
ro: concurs MOSS

source: Rate contests
ro: Evaluează concursuri

source: Contest access codes
ro: codul de acces al concursului

source: Create private contests
ro: Creează concursuri private

source: contest
ro: concurs

source: contests
ro: concursuri

source: associated contest
ro: concurs asociat

source: score
ro: scor

source: cumulative time
ro: timp cumulat

source: is disqualified
ro: este descalificat

source: Whether this participation is disqualified.
ro: Dacă participarea este descalificată

source: virtual participation id
ro: id participare virtual

source: 0 means non-virtual, otherwise the n-th virtual participation.
ro: 0 inseamnă non-virtual, altfel al n-lea participare virtuală.

source: contest format specific data
ro: date specifice formatului concursului

source: %s spectating in %s
ro: %s urmărește în %s

source: %s in %s, v%d
ro: %s în %s, v%d

source: %s in %s
ro: %s în %s

source: contest participation
ro: participarea la concurs

source: contest participations
ro: participările la concurs

source: problem
ro: problemă

source: points
ro: puncte

source: partial
ro: parțial

source: is pretested
ro: este pretestat

source: order
ro: ordine

source: output prefix length override
ro: marimea prefixului afișării

source: Maximum number of submissions for this problem, or 0 for no limit.
ro: Numărul maxim de soluții pentru această problemă, sau 0 pentru nicio limită.

source: Why include a problem you can't submit to?
ro: De ce să incluzi o problemă unde nu poți trimite soluții?

source: contest problem
ro: problema din concurs

source: contest problems
ro: problemele din concurs

source: submission
ro: soluție

source: participation
ro: participare

source: Whether this submission was ran only on pretests.
ro: Dacă această soluție a fost rul

source: contest submission
ro: submisie de concurs

source: contest submissions
ro: submisii de concurs

source: rank
ro: ranc

source: rating
ro: scor

source: volatility
ro: volatilitate

source: last rated
ro: ultimul scor

source: contest rating
ro: rating de la concurs

source: contest ratings
ro: ratinguri de la concurs

source: contest moss result
ro: rezultat la concurs moss

source: contest moss results
ro: rezultate la concurs moss

source: configuration item
ro: element de configurare

source: miscellaneous configuration
ro: configurare diversă

source: navigation item
ro: element de navigare

source: navigation bar
ro: bara de navigare

source: identifier
ro: identificator

source: label
ro: etichetă

source: highlight regex
ro: regex evidențiat

source: parent item
ro: lucru al părintelui

source: post title
ro: postează titlu

source: authors
ro: autori

source: slug
ro: melc

source: public visibility
ro: vizibilitate publică

source: sticky
ro: lipit

source: publish after
ro: publică după

source: post content
ro: postează conținut

source: post summary
ro: postează rezumat

source: openGraph image
ro: imagine openGraph

source: Edit all posts
ro: Editează toate postările

source: blog post
ro: postare pe blog

source: blog posts
ro: postări pe blog

source: message title
ro: titlu mesaj

source: message body
ro: corp mesaj

source: sender
ro: emițător

source: target
ro: țintă

source: message timestamp
ro: timp mesaj

source: read
ro: văzut

source: messages in the thread
ro: mesaje în topic

source: problem category ID
ro: ID-ul categoriei problemei

source: problem category name
ro: numele categoriei problemei

source: problem group ID
ro: ID-ul grupului problemei

source: problem group name
ro: numele grupului problemei

source: problem group
ro: grupul problemei

source: problem groups
ro: grupurile problemei

source: language
ro: limbaj

source: key
ro: cheie

source: full name
ro: nume complet

source: short name
ro: nume scurt

source: Displayed on pages under this license
ro: Afişat pe paginile sub această licenţă

source: icon
ro: pictogramă

source: URL to the icon
ro: Hyperlink către icon

source: license text
ro: text licență

source: license
ro: licență

source: licenses
ro: licențe

source: Contest
ro: Concurs

source: problem name
ro: numele problemei

source: problem body
ro: corpul problemei

source: These users will be able to edit the problem, and be listed as authors.
ro: Acești utilizatori vor putea edita problema și să fie listați ca autori.

source: curators
ro: curatori

source: These users will be able to edit the problem, but not be listed as authors.
ro: Acești utilizatori vor putea edita problema fără să fie listați ca autori.

source: testers
ro: testeri

source: These users will be able to view the private problem, but not edit it.
ro: Acești utilizatori vor putea vedea problema privată, dar nu să o editeze.

source: The group of problem, shown under Category in the problem list.
ro: Grupul problemei, arătat în categorie.

source: The time limit for this problem, in seconds. Fractional seconds (e.g. 1.5) are supported.
ro: limita de timp pentru această problemă, în secunde. Secunde fracționale se pot folosi (1.5).

source: memory limit
ro: limită de memorie

source: The memory limit for this problem, in kilobytes (e.g. 64mb = 65536 kilobytes).
ro: Limita de memorie pentru această problemă în kilobytes (64mb = 65536 kb).

source: allows partial points
ro: permite puncte parțiale

source: allowed languages
ro: limbi permise

source: List of allowed submission languages.
ro: Lista de limbi permise ale soluților.

source: manually managed
ro: întreprins manual

source: Whether judges should be allowed to manage data or not.
ro: Dacă grader-ul este lăsat să se ocupe de date sau nu.

source: date of publishing
ro: data publicării

source: Doesn't have magic ability to auto-publish due to backward compatibility
ro: Nu are abilitatea magică de a se auto-publica din cauza compatibilității retroactive

source: Bans the selected users from submitting to this problem.
ro: Interzice utilizatorilor selectați să trimită surse către această problemă.

source: The license under which this problem is published.
ro: Licența în care este distrbuită această problemă.

source: problem summary
ro: rezumatul problemei

source: number of users
ro: numărul de utilizatori

source: The number of users who solved the problem.
ro: Numărul de utilizatori care au rezolvat problema.

source: solve rate
ro: rata de rezolvare

source: If private, only these organizations may see the problem.
ro: Dacă este privată, numai aceaste organizații pot vedea problema.

source: translated name
ro: numele tradus

source: translated description
ro: descrierea tradusă

source: problem translation
ro: traducerea problemei

source: problem translations
ro: traducerile problemei

source: clarified problem
ro: clarificarea problemei

source: clarification body
ro: clarificarea corpului

source: clarification timestamp
ro: clarificarea timpului

source: language-specific resource limit
ro: limita de resurse specifică limbii

source: language-specific resource limits
ro: limite de resurse specifică limbii

source: associated problem
ro: problemă asociată

source: publish date
ro: data publicării

source: editorial content
ro: conținut editorial

source: Floats
ro: Numere reale

source: Floats (absolute)
ro: Numere reale (absolute)

source: Floats (relative)
ro: Numere reale (relative)

source: Non-trailing spaces
ro: Fară spații în coadă

source: Unordered
ro: Neordonat

source: Byte identical
ro: Identic ca biți

source: Line-by-line
ro: Linie-cu-linie

source: data zip file
ro: archiva cu date

source: generator file
ro: fișier generator

source: output prefix length
ro: marimea prefixului afisării

source: output limit length
ro: limita prefixului afisării

source: init.yml generation feedback
ro: feedback-ul generării init.yml

source: checker
ro: verificator

source: checker arguments
ro: argumentele verificatorului

source: checker arguments as a JSON object
ro: argumentele verificatorului ca obiect JSON

source: problem data set
ro: setul de date ale problemei

source: case position
ro: poziția cazului

source: case type
ro: tipul cazului

source: Normal case
ro: Cazul normal

source: Batch start
ro: Începutul grupului

source: Batch end
ro: Sfârșitul grupului

source: input file name
ro: numele fișierului de citire

source: output file name
ro: numele fișierului de afișare

source: generator arguments
ro: argumentele generatorului

source: point value
ro: punctaj

source: case is pretest?
ro: cazul este pretest?

source: organization title
ro: titlul organizației

source: organization slug
ro: melcul organizației

source: Organization name shown in URL
ro: Numele organizației arătat în URL

source: Displayed beside user name during contests
ro: Afişat lângă numele de utilizator în timpul concursurilor

source: organization description
ro: descrierea organizației

source: registrant
ro: registratul

source: User who registered this organization
ro: Utilizatorul care a înregistrat această organizaţie

source: administrators
ro: administratori

source: Those who can edit this organization
ro: Cei care pot edita această organizaţie

source: creation date
ro: data creerii

source: is open organization?
ro: este organizație deschisă?

source: Allow joining organization
ro: Permite aderarea la organizaţie

source: maximum size
ro: marimea maximă

source: Maximum amount of users in this organization, only applicable to private organizations
ro: Marimea maximă de utilizatori în această organizație, se aplică doar la organizațiile private

source: Student access code
ro: Codul de acces al studenților

source: This image will replace the default site logo for users viewing the organization.
ro: Această imagine v-a înlocuii logo-ul implicit al site-ului pentru utilizatorii care privesc această organizație

source: organization
ro: organizație

source: user associated
ro: utilizator asociat

source: self-description
ro: auto-descriere

source: location
ro: locație

source: preferred language
ro: limbă preferată

source: last access time
ro: ultima accesare

source: last IP
ro: ultimul IP

source: display rank
ro: rank-ul

source: comment mute
ro: asurzire comentariu

source: Some users are at their best when silent.
ro: Pe unii utilizatori e preferabil sa nu ȋi auzi.

source: unlisted user
ro: utilizator nelistat

source: User will not be ranked.
ro: Utilizatorul nu va fi evaluat.

source: user script
ro: scriptul utilizatorului

source: User-defined JavaScript for site customization.
ro: JavaScript definit de utilizator pentru personalizarea site-ului.

source: current contest
ro: concursul actual

source: math engine
ro: motorul matematic

source: the rendering engine used to render math
ro: motorul de randat folosit pentru randarea matematicii

source: 2FA enabled
ro: 2FA activat

source: check to enable TOTP-based two factor authentication
ro: bifează pentru a activa 2FA bazat pe TOTP

source: TOTP key
ro: cheia TOTP

source: 32 character base32-encoded key for TOTP
ro: cheia de 32 de caractere pentru TOTP

source: TOTP key must be empty or base32
ro: cheia TOTP trebuie să fie goala sau base32

source: internal notes
ro: notă internă

source: Notes for administrators regarding this user.
ro: Note pentru administratori în privința acestui utilizator.

source: user profile
ro: profil utilizator

source: user profiles
ro: profiluri utilizatori

source: request time
ro: timpul de cere

source: state
ro: stare

source: reason
ro: motiv

source: organization join request
ro: cerere de a se alătura organizaţiei

source: organization join requests
ro: cereri de a se alătura organizaţiei

source: short identifier
ro: identificator scurt

source: The identifier for this language; the same as its executor id for judges.
ro: Identificatorul pentru acest limbaj de programare, același pentru id-ul de executare al grader-ului

source: long name
ro: nume lung

source: Longer name for the language, e.g. "Python 2" or "C++11".
ro: Numele lung pentru limbaj, "Python 2" sau "C++11"

source: More readable, but short, name to display publicly; e.g. "PY2" or "C++11". If left blank, it will default to the short identifier.
ro: Mai citibil, dar mai scurt, nume pentru distribuire publică, "PY2" or "C++11". Dacă este lăsat gol, se v-a folosi identificatorul scurt

source: common name
ro: nume comun

source: Common name for the language. For example, the common name for C++03, C++11, and C++14 would be "C++"
ro: Numele comun pentru limbaj. De exemplu, numele comun pentru C++03, C++11, ar fi C++

source: ace mode name
ro: numele modului as

source: Language ID for Ace.js editor highlighting, appended to "mode-" to determine the Ace JavaScript file to use, e.g., "python".
ro: ID-ul limbajului pentru evidențierea editorului Ace.js, a se adăuga la "mode-", pentru a determina documentul Ace JavaScript care trebuie să fie folosit, "python".

source: pygments name
ro: numele pigmenților

source: Language ID for Pygments highlighting in source windows.
ro: ID-ul limbajului pentru pigmenții de evidențiere în fereastra sursei.

source: code template
ro: șablonul codului

source: Code template to display in submission editor.
ro: Șablonul codului de afișat în editorul de soluții.

source: runtime info override
ro: sarire informație de runtime
