Repository: Prekzursil/webcoder
Catalog: site/locale/*/LC_MESSAGES/django.po
Languages: ro

source: Reason
ro: Motiv

source: There are no requests to approve.
ro: Nu aveți cereri de aprobare.

source: Delete?
ro: Ştergeţi?

source: Your reason for joining:
ro: Motivul pentru care doriți să vă alăturați:

source: Request
ro: Solicitare

source: Pending
ro: Nehotărât

source: Log
ro: Jurnal

source: Approved
ro: Aprobat

source: Rejected
ro: Respins

source: Kick
ro: Dă afară

source: Enter a new code for the cloned problem:
ro: Introdu codul nou pentru problema clonată:

source: View YAML
ro: Vezi YAML

source: Show columns:
ro: Arată coloanele:

source: Output prefix
ro: Prefixul afișării

source: Output limit
ro: Limita afișării

source: Checker
ro: Verificator

source: Generator args
ro: Argumentele generatorului

source: Type
ro: Tip

source: Input file
ro: Fișier de intrare

source: Output file
ro: Fișier de ieșire

source: Submit!
ro: Trimiteți!

source: Add new case
ro: Adaugă un nou test

source: Remember to use this editorial <b>only</b> when stuck, and <b>not to copy-paste code from it</b>. Please be respectful to the problem author and editorialist. <br><br> <b>Submitting an official solution before solving the problem yourself is a bannable offence.</b>
ro: Tine minte să folosești redactarea <b>doar</b> când nu reușești, și <b>nu să dai copy-paste</b>.

source: Author:
ro: Autor:

source: Hot problems
ro: Probleme noi

source: View Problem
ro: Probleme noi

source: Problem Completed
ro: Completed

source: Partial Score
ro: Scor final:

source: No Problems Found
ro: Codul problemei

source: Category
ro: Categorie

source: Types
ro: Tipuri

source: AC %%
ro: Rata %%

source: Leave empty to not filter by language
ro: Lasă gol să nu filtrezi după limbaj

source: Leave empty to not filter by result
ro: Lasă gol să nu filtrezi după rezultat

source: Need valid values for both start and end IDs.
ro: Este nevoie de valori valide pentru începutul și sfârșitul ID-urilor

source: End ID must be after start ID.
ro: Sfârșitul ID-ului trebuie să fie după începutul ID-ului

source: You are about to rejudge {count} submissions. Are you sure you want to do this?
ro: Sunteți aproape să rejudecați {count} soluții. Sunteți sigur că vreți să faceți asta?

source: You are about to rejudge a few submissions. Are you sure you want to do this?
ro: Sunteți aproape să rejudecați câteva soluții. Sunteți sigur că vreți să faceți asta?

source: Rejudge Submissions
ro: Rejudecă Soluțiile

source: Filter by ID:
ro: Filtrează după ID:

source: Starting ID:
ro: Începutul ID-ului:

source: Ending ID:
ro: Sfârșitul ID-ului:

source: This range includes both endpoints.
ro: Aceast interval include ambele capete.

source: Filter by language:
ro: Filtrează după limbaj:

source: Filter by result:
ro: Filtrează după rezultat:

source: Rejudge selected submissions
ro: Rejudecă soluțiile selectate

source: Rescore Everything
ro: Repunctează Tot

source: This will rescore %(count)d submissions.
ro: Aceasta va repuncta %(count)d soluții.

source: Are you sure you want to rescore %(count)d submissions?
ro: Ești sigur că vrei să repunctezi %(count)d soluții?

source: Rescore all submissions
ro: Repunctează toate soluțiile

source: Discussions
ro: submisii

source: Hints
ro: Puncte

source: Test Cases
ro: Caz de test

source: Submissions
ro: submisii

source: Score
ro: Scor

source: Request clarification
ro: Cere clarificare

source: Report an issue
ro: Raportează o eroare

source: Best submissions
ro: Cele mai bune soluţii

source: Manage tickets
ro: Administrează rapoartele

source: Edit problem
ro: Schimbă problema

source: Edit test data
ro: Editează datele testului

source: My tickets
ro: Rapoartele mele

source: Manage submissions
ro: Administrează soluțiile

source: Clone problem
ro: Duplică problemă

source: Points:
ro: Puncte:

source: (partial)
ro: (parţial)

source: Time limit:
ro: Limita de timp:

source: Memory limit:
ro: Limita de memorie:

source: Problem type
ro: Tip de problemă

source: Allowed languages
ro: Limbajele acceptate

source: No %(lang)s judge online
ro: Nici un judge pentru %(lang)s e online

source: Judge:
ro: Grader:

source: none available
ro: Niciunul Valabil

source: View as PDF
ro: Versiune PDF

source: Submit solution
ro: Trimite soluţie

source: %(counter)s submission left
ro: %(counter) soluție ramasă

source: 0 submissions left
ro: 0 soluții ramase

source: Read editorial
ro: Citește editorialul

source: No hints were posted for this problem.
ro: Nici un judge nu este disponibil pentru această problemă.

source: Statement
ro: Stare

source: Submit Solution
ro: Trimite soluţie

source: Please log in to submit a solution
ro: Logați-vă să votați

source: No official source is available for this problem yet.
ro: Nici un judge nu este disponibil pentru această problemă.

source: No submissions posted so far.
ro: testul submisiei

source: No test cases are available for this problem yet.
ro: Nici un judge nu este disponibil pentru această problemă.

source: Time Limit:
ro: Limită De Timp:

source: Memory Limit:
ro: Limită De Memorie:

source: Filter Problems
ro: Clonează Problema

source: Search problems...
ro: Căutaţi problemele...

source: Full text search
ro: Căutare dupa text complet

source: Only contest problems
ro: Problemele din concurs

source: Show problem types
ro: Arata tipul de probleme

source: All
ro: Toate

source: Point range
ro: Interval puncte

source: Go
ro: Caută

source: Random
ro: Aleatoriu

source: <b>Warning!</b> Your default language, <b>%(default_language)s</b>, is unavailable for this problem and has been deselected.
ro: <b>Atentie!</b> Limbajul tau implicit, <b>%(default_language)s</b>, nu este valabil pentru această problemă și a fost deselectată.

source: You have %(left)s submission left
ro: Mai ai %(left)s soluție rămasă

source: You have 0 submissions left
ro: Mai ai 0 soluții rămase

source: No judge is available for this problem.
ro: Nici un judge nu este disponibil pentru această problemă.

source: %(key)s is an invalid activation key.
ro: %(key)s este o cheie de activare invalidă.

source: Your account has been successfully activated.
ro: Contul a fost activat cu succes.

source: Invalid username or password.
ro: Nume de utilizator sau parolă invalide.

source: Login!
ro: Conectaţi-vă!

source: Forgot your password?
ro: Ai uitat parola?

source: Or log in with...
ro: Sau log in cu...

source: See you later!
ro: Pe mai târziu!

source: Your password was sucessfully changed.
ro: Parola a fost cu succes schimbată.

source: Change Password
ro: Schimbă parola

source: Send Reset Email
ro: Trimite email de resetare

source: Your password has been set. You may go ahead and log in now
ro: Parola dumneavoastră a fost setată. Acum puteți să vă logați

source: Reset Password
ro: Resetează parola

source: We've emailed you instructions for setting your password. You should be receiving them shortly.
ro: Am trimis pe mail instrucțiunile de setare a parolei.

source: If you don't receive an email, please make sure you've entered the address you registered with, and check your spam folder.
ro: Dacă nu primiți niciun email, asigurați-vă că ați folosit adresa de email cu care v-ați înregistrat, și verificați eventual folderul de spam.

source: You're receiving this email because you requested a password reset for your user account at %(site_name)s.
ro: Ați primit acest email pentru că aţi solicitat resetarea parolei pentru contul dumneavoastră de utilizator pe %(site_name)s.

source: Please go to the following page and choose a new password:
ro: Vă rugăm să accesați următoarea pagină şi să alegeţi o parolă nouă:

source: Your username, in case you've forgotten:
ro: Numele de utilizator, în cazul in care aţi uitat:

source: Thanks for using our site!
ro: Vă mulţumim pentru utilizarea site-ului nostru!

source: The %(site_name)s team
ro: Echipa %(site_name)s

source: Password reset on %(site_name)s
ro: Parola resetată pe %(site_name)s

source: Continue >
ro: Continuă >

source: Registration is currently closed. Please contact an administrator.
ro: Înregistrarea este deocamdată închisă. Vă rugăm să contactați un administrator.

source: You have successfully been registered. An email has been sent to the email address you provided to confirm your registration.
ro: V-ați înregistrat cu succes! Un email a fost trimis la adresa de email oferită pentru a confirma înregistrarea dumneavoastră.

source: (again, for confirmation)
ro: (din nou, pentru confirmare)

source: (select your closest major city)
ro: (selectați cel mai apropiat oraș)

source: pick from map
ro: alege de pe hartă

source: Default language
ro: Limbaj implicit

source: Affiliated organizations
ro: Organizație afiliată

source: Notify me about upcoming contests
ro: Anunță-ma despre concursurile care apar

source: By registering, you agree to our
ro: Înregistrându-vă, sunteți de acord cu

source: Terms & Conditions
ro: Termenii & Condițiile

source: Register!
ro: Înscrie-te!

source: Enter the 6-digit code generated by your app:
ro: Introdu codul de 6 cifre generat de către aplicație de 2FA

source: If you lost your authentication device, please contact us at %(email)s.
ro: Dacă ați pierdut dispozitivul de autentificare, va rugăm contactați la %(email)s.

source: To protect your account, you must first authenticate before you can disable Two Factor Authentication.
ro: Pentru a vă proteja contul, trebuie să vă autentificați înainte să opriți 2FA.

source: Scan this code with your authenticator app
ro: Scanați acest cod cu aplicația de autentificare 2FA:

source: QR code
ro: cod QR

source: Or enter this code manually:
ro: Sau introduceți acest cod manual:

source: Submission Statistics
ro: Statistică Soluții

source: AC Submissions by Language
ro: Soluții corecte (AC) după limbă

source: Judge
ro: Grader

source: Online
ro: Conectat

source: Load
ro: Încărcare

source: N/A
ro: Niciunul

source: There are no judges available at this time.
ro: Nu există judecător valabil acum.

source: Version Matrix
ro: Versiunea matricii

source: An internal error occurred while grading.
ro: O eroare internă a apărut în timpul notării.

source: Error information
ro: Informație eroare

source: Filter by status
ro: Filtrează după status...

source: Filter by language
ro: Filtrează după limbaj:

source: You were disconnected. Refresh to show latest updates.
ro: Ați fost deconectat. Dați refresh pentru a vă arăta cele mai noi informații.

source: Case #%(case)s
ro: Cazul #%(case)s

source: view
ro: vezi

source: rejudge
ro: rejurizează

source: Filter Submissions
ro: Filtrează soluțiile

source: View status
ro: Vezi stare

source: View raw source
ro: Vezi sursa în format brută

source: Resubmit
ro: Trimiteți din nou

source: We are waiting for a suitable judge to process your submission...
ro: Asteptam un judge potrivit pentru a procesa submiterea ta...

source: Your submission is being processed...
ro: Soluția ta este în curs de procesare...

source: Compilation Error
ro: Eroare de compilare

source: Compilation Warnings
ro: Avertismente de compilare

source: Pretest Execution Results
ro: Rezultatele Execuției pe Preteste

source: Execution Results
ro: Rezultate de executare

source: Batch
ro: Lot

source: Case
ro: Caz

source: Test case
ro: Caz de test

source: Your output (clipped)
ro: Output-ul tau (micșorat)

source: Judge feedback
ro: Feedback-ul grader-ului

source: Resources:
ro: Resurse:

source: Final pretest score:
ro: Scorul final al pretestului:

source: Final score:
ro: Scor final:

source: Passing pretests does not guarantee a full score on system tests.
ro: Trecând cu succes pretestele nu vă garantează scorul maxim pe restul testelor.

source: Submission aborted!
ro: Soluția a fost anulată!

source: View source
ro: Vezi sursa

source: Abort
ro: Anuleaza

source: Mine
ro: Al meu

source: Best
ro: Cel mai bun

source: Reopened:
ro: Redeschis:

source: Closed:
ro: Închis

source: Use desktop notification
ro: Folosiți notificări pe desktop

source: Show my tickets only
ro: Arată doar rapoartele mele

source: Filing user
ro: Completând utilizatorul

source: Assignee
ro: Delegat

source: Title
ro: Titulul

source: Assignees
ro: Delegați

source: Thanks for opening a ticket!
ro: Mulțumim că ați deschis acest raport!

source: Please keep in mind that this form is for reporting issues with a problem statement, and not for asking for help. If you require assistance on solving a problem, ask in the comments instead.
ro: Tineți minte că această modalitate este folosită pentru a raporta probleme, nu să cerem ajutor.

source: Associated object
ro: Obiect associat

source: No one is assigned.
ro: Nimeni nu e delegat.

source: Close ticket
ro: Închide raportul

source: Reopen ticket
ro: Redeschide raportul

source: Assignee notes
ro: Notițele delegatului

source: Nothing here.
ro: Nimic aici.

source: Post
ro: Postează

source: Rank
ro: Rang

source: Search by handle...
ro: Caută după tag

source: Are you sure you want to generate or regenerate your API token?
ro: Ești sigur că vrei să părăsești această organizație?

source: Self-description
ro: Auto-descriere

source: Select your closest major city
ro: Selectează cel mai apropiat oraș

source: Editor theme
ro: Tema editorului

source: Math engine
ro: Motorul matematic

source: Change your avatar
ro: Schimbați avatarul

source: Change your password
ro: Schimbați parola

source: Two Factor Authentication is disabled.
ro: 2FA este dezactivat

source: User-script
ro: Script de utilizator

source: Update profile
ro: Actualizați profilul

source: weighted <b>%(weight)s%%</b>
ro: cântărește <b>%(weight)s%%</b>

source: Admin Notes
ro: Notițele administratorului

source: About
ro: Despre

source: You have not shared any information.
ro: Nu aţi împărtăşit nicio informaţie.

source: This user has not shared any information.
ro: Acest utilizator nu a împărtăşit nicio informaţie.

source: Points Breakdown
ro: Ruperea punctelor

source: Load more...
ro: Încarcă mai mult...

source: This user has not yet solved any problems.
ro: Acest utilizator nu a rezolvat nicio problemă până acum.

source: Authored Problems
ro: Probleme create

source: Hide problems I've solved
ro: Ascunde probleme care am rezolvat

source: %(points).1f points
ro: %(points).1f puncte

source: %(counter)s problem solved
ro: %(counter)s problemă rezolvată

source: Rank by points:
ro: Clasament după puncte:

source: Total points:
ro: Numărul total de puncte:

source: Rank by rating:
ro: Clasament după rating:

source: Volatility:
ro: Volatilitate:

source: Min. rating:
ro: Rată minimă

source: Max rating:
ro: Rată maximă

source: Impersonate
ro: Impersonează

source: Admin User
ro: Utilizator Administrator

source: Admin Profile
ro: Profilul Administrator

source: Check all
ro: Selectează tot
